-- First-class Function

-- Зад. 1 - Функция, която увеличава стойността на параметъра с 1
add :: Int -> Int
add x = x + 1
-- Пример: add 5 == 6

-- Зад. 2 - Функцуя, която връща произведение от подадените параметъри (double)
multy :: Double ->Double -> Double  -- приема два параметъра от тип Double и връща Double
multy a b = a * b
-- Пример: multy 2.5 4.0 == 10.0

-- Зад. 3 - Функцуя, която връща произведение от подадените параметъри (Numeric type)
multyNum :: Num a => a -> a -> a  -- Ограничава типа `a` до числови типове (Int, Float, Double и т.н.)
multyNum x y = x * y
-- Пример: multyNum (2 :: Int) (3 :: Int) == 6
--         multyNum (2.5 :: Double) 4.0 == 10.0

-- Зад. 4 - Функция, която намира сумата на първите n естествени числа
sumN :: Int -> Int   
sumN n = sum [1..n]
-- Пример: sumN 5 == 15

-- Зад. 5 - Функция, която умножава по-голямото от две подадени числа с трето (multiple typeclass constraints) 
multyMax :: (Num a, Ord a) => a -> a -> a -> a -- Ограничава типа `a` така, че да може да се сравнява и умножава
multyMax a b x = (max a b) * x
-- Пример: multyMax 2 5 10 == 50

-- Зад. 6 -  Функция, която връща по-голямата от две стойности
max1 :: Ord a => a -> a -> a -- Класът `Ord` позволява използване на оператори за сравнение (>, <, >=, <=) за тип `a`
max1 x y =
    if x >= y
        then x
        else y
-- Пример: max1 "echo" "eho" == "eho" (лексикографски ред)
--         max1 3.4 34 == 34 (числов ред)


-- Зад. 7 - Функция, която връща по-дългия от два низа
maxLen :: String -> String -> String
maxLen a b =
    if length a >= length b
        then a
        else b
-- Пример: maxLen "cat" "tiger" == "tiger"

-- Зад. 8 - Функция, която приема като аргумент друга функция и ѝ подава параметър 3
pass3 :: Num t1 => (t1 -> t2) -> t2 --Това показва, че функциите са "от първи клас" (могат да се подават като стойности)
pass3 f = f 3
-- Пример: pass3 add == 4

-- Зад. 9 - Функция, която умножава подадения параметър по 2
mult2 :: Num a => a -> a
mult2 x = 2 * x
-- Пример: mult2 7 == 14

-- Зад. 10 - Композиция от функции
compose :: (t1 -> t2) -> (t3 -> t1) -> t3 -> t2 ---- Композира две функции: резултатът на втората е аргумент на първата
compose f g x = f (g x)
-- Пример: (compose add mult2) 3 == add (mult2 3) == 7



